#include <iostream>
#include "windows.h"

using namespace std;

int main(){
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	cout << "\t\t\t\t\tРезюме\n" << endl;
	cout << "Всім привіт, Мене звати Мак Мяукскул, так, моє ім`я може здатись дивним, бо\n"
		<< "це не звичайний світ який ми вже звикли бачити, а світ тварин і в цьому резюме \n"
		<< "розповім про себе\n" << endl;
	cout << "Для початку напишу свої котячі дані:\n"
		<< "\tКраїна: CUS(Cat United State)\n"
		<< "\tВулиця: Кошаки 32А\n"
		<< "\temeow: mcmeowscul&meow.mur, замість собаки інший символ, бо не всі коти люблять їх\n"
		<< "\tcatgram: @milkfish\n";
	cout << "РОБОТА:\n"
		<< "\t В основному багато котів працюють на компанію \"Whiskas\", бо там іноді роздають\n"
		<<"\t безкоштовні коробки з кормом, тому всім котам там подобається працювати,  але\n"
		<<"\t я обрав дещо іншу роботу, яка мені по душі.\n"
		<<"\t Я проацюю на фірму TFC, що розшифровується як \"Taxi for Cats\", обрав таку роботу\n"
		<<"\t бо полюбляю розвозити котів до різних котячих точок, впізнавати цікаві місця і взагалі\n"
		<<"\t розмовляти з котами на різні теми їдучи в машині\n"<<endl;
	cout << "Плани на майбтнє:\n"
		<<"\t Хоч я і працюю в таксі, але все в житті котячому хочеться чогось лінивого, щоб можна було\n"
		<<"\t довше полежати і поспати. Хочу навчитись кодуванню на мові Fish, Mouse++\n"<<endl;
	cout << "Мови:\n"
		<< "\tЗнаю декілька мов:\n"
		<< "\t\t- Котячу *****\n"
		<< "\t\t- Їжачу ***--\n"
		<< "\t\t- Пташину **---\n"
		<< "\t\t- Попугайську *----\n" << endl;
	cout << "Додаткові навички:\n"
		<< "\tВміння знаходити найзатишніші місця для дрімоти\n"
		<< "\tМайстерне муркотіння на 10 з 10\n"
		<< "\tМ'яке приземлення навіть після невдалих стрибків\n"
		<< "\tШвидкісне розплутування клубків ниток\n"
		<< "\tМожу дивитись у вікно годинами, створюючи атмосферу затишку\n" << endl;
	cout << "Хобі:\n"
		<< "\tПолювання на червоні цятки від лазерної указки\n"
		<< "\tКолекціонування найзручніших коробок\n"
		<< "\tТестування м'якості пледів і подушок\n"
		<< "\tВивчення нового асортименту кормів(особливо преміум-сегменту)\n"
		<< "\tПрослуховування пташиних концертів за вікном\n" << endl;
	cout << "Улюблені Місця:\n"
		<< "\tКафе «Catpuccino», де подають найсвіжіше молочко\n"
		<< "\tПарк «М'які Лапки» — ідеальне місце для прогулянок і знайомств із сусідськими котами\n"
		<< "\tКотячий кінотеатр «Murflix», де показують відео з рибками\n" << endl;
	cout << "Чому Я?\n"
		<< "Бо я не просто кіт, а справжній Мяукскул із неповторним мурчанням і щирим бажанням розвиватись!" << endl;


	

		
		
	 


	return 0;
	
}